УНФ_ТЕСТ/src/AccumulationRegisters/ЗапасыПринятые/ЗапасыПринятые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапасыПринятые</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПриемаПередачи</name>
    <type>
      <types>EnumRef.ТипыПриемаПередачиТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ/src/AccumulationRegisters/ЗапасыПринятые/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗапасыПринятые.НомерСтроки КАК НомерСтроки,
	|	ЗапасыПринятые.Организация КАК Организация,
	|	ЗапасыПринятые.Номенклатура КАК Номенклатура,
	|	ЗапасыПринятые.Характеристика КАК Характеристика,
	|	ЗапасыПринятые.Партия КАК Партия,
	|	ЗапасыПринятые.Контрагент КАК Контрагент,
	|	ЗапасыПринятые.Договор КАК Договор,
	|	ЗапасыПринятые.Заказ КАК Заказ,
	|	ЗапасыПринятые.ТипПриемаПередачи КАК ТипПриемаПередачи,
	|	ЗапасыПринятые.Количество КАК КоличествоПередЗаписью,
	|	ЗапасыПринятые.Количество КАК КоличествоИзменение,
	|	ЗапасыПринятые.Количество КАК КоличествоПриЗаписи,
	|	ЗапасыПринятые.СуммаРасчетов КАК СуммаРасчетовПередЗаписью,
	|	ЗапасыПринятые.СуммаРасчетов КАК СуммаРасчетовИзменение,
	|	ЗапасыПринятые.СуммаРасчетов КАК СуммаРасчетовПриЗаписи
	|ПОМЕСТИТЬ ДвиженияЗапасыПринятыеИзменение
	|ИЗ
	|	РегистрНакопления.ЗапасыПринятые КАК ЗапасыПринятые");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗапасыПринятыеИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Контрагент)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
